# 3. Даны средние температуры каждого месяца (кортеж).
# Нужно посчитать среднюю температуру за год.
tuple1 =(-15, -17, 1, 8, 15, 18.5, 24, 28, 20, 18, 8, -6)
print(f"Средняя температура за год: {(sum(tuple1))/len(tuple1)}")
