# 1. Создайте кортеж из диапазона чисел от 10 до 20.
# Затем посчитайте сумму всех элементов.
import random
tuple1 = (10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20)
print(f"Сумма чисел кортежа {tuple1} равна {sum(tuple1)}")
